tutorials/cfdemSolverIB/falling_sphere_two_way_coupling/CFD/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      couplingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// sub-models & settings

modelType none;

checkPeriodicCells;

verbose;

couplingInterval 10;

depth 0;

voidFractionModel IB;

locateModel engineIB;

meshMotionModel noMeshMotion;

regionModel allRegion;

dataExchangeModel twoWayMPI;

IOModel basicIO;

probeModel off;

averagingModel dilute;

clockModel off;

smoothingModel off;

forceModels
(
    ShirgaonkarIB
    ArchimedesIB
);

momCoupleModels
(
);

turbulenceModelType "turbulenceProperties";

// sub-model properties

ShirgaonkarIBProps
{
    velFieldName "U";
    pressureFieldName "p";
    densityFieldName "rho";
    verbose;
    useTorque;
}

ArchimedesIBProps
{
    densityFieldName "rho";
    gravityFieldName "g";
    voidfractionFieldName "voidfractionNext";
}

twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}

IBProps
{
    maxCellsPerParticle 20000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}

engineIBProps
{
    engineProps
    {
        treeSearch false;
    }
    zSplit 8;
    xySplit 16;
}

// ************************************************************************* //
